# vsoContextM_Enable

## Description
Enable an item in the context menu of the object during ObjectContextMenuEvent::kAction_Init event.

```pascal
PROCEDURE vsoContextM_Enable(
				itemID : INTEGER;
				enable : BOOLEAN);
```

```python

def vs.vsoContextM_Enable(itemID, enable):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|itemID|INTEGER||
|enable|BOOLEAN||

## Version
Availability: from Vectorworks 2014
## Category
* Object Events